package again25;

/**
 * Author: hetsketch
 * Created: 8/22/2016
 */

/**
 * HR-менеджер опять был расстроен. Очередной кандидат так же провалил собеседование, как и 24 предыдущих.
 * «Неужели я даю такое сложное задание? — думал HR-менеджер. — Всего лишь возвести число 5 в степень n и узнать
 * последние две цифры числа. Да, конечно, n может быть большим, и на калькуляторе такую степень не посчитать, но
 * нам и нужны люди, способные думать, а не только инструкции исполнять.»
 * <p>
 * А вы смогли бы пройти собеседование в компании, занимающейся машинным зрением в ИТ-граде?
 * <p>
 * Входные данные
 * Единственная строка входных данных содержит одно целое число n (2 ≤ n ≤ 2·1018) — степень, в которую вам нужно
 * возвести число 5.
 * <p>
 * Выходные данные
 * Выведите последние две цифры числа 5n без пробелов между ними.
 */
public class Again25 {
    public static void main(String[] args) {
        //any pow of 5 ends with 25
        System.out.println("25");
    }
}
